
-- Добавление авиакомпаний в таблицу Airlines
INSERT INTO
    Airlines (airline_id, name, code, country)
VALUES
    (456439,'Аэрофлот','SU','Россия'),
    (2526005,'9 Air','AQ','Китай'),
    (1287223,'Aer Lingus','EI','Ирландия'),
    (2941943,'Aigle Azur','ZI','Франция'),
    (2833299,'Air Arabia','G9','ОАЭ'),
    (2911813,'Air Berlin','AB','Германия'),
    (2324603,'Air Bucharest','B1*','Румыния'),
    (2475933,'Air Canada','AC','Канада'),
    (1044948,'Air China','CA','Китай'),
    (2591670,'Air Creebec','YN','Канада'),
    (712245,'Air Europa','UX','Испания'),
    (1918455,'Air France','AF','Франция'),
    (2584653,'Air Guilin','GT','Китай'),
    (2308455,'Air Nostrum','YW','Испания'),
    (2414125,'Air VIA','VL','Болгария'),
    (1717144,'Qantas','QF','Австралия'),
    (51039,'Победа','DP','Россия'),
    (2118143,'S7 Airlines','S7','Россия'),
    (2223225,'UTair','UT','Россия'),
    (2716522,'Bulgaria Air','FB','Болгария'),
    (15685,'Meridiana','IG','Италия'),
    (718567,'Cirrus Airlines','C9','Германия'),
    (2118959,'Turkish Airlines','TK','Турция'),
    (2476640,'Pegasus Airlines','H9','Турция'),
    (1861370,'Corendon Airlines','XC','Турция'),
    (1029938,'IZair','4I','Турция'),
    (1687366,'Israir','6H','Израиль'),
    (2067634,'Icelandair','FI','Исландия'),
    (37552,'Iberia','IB','Испания'),
    (2369987,'Emirates Airline','EK','ОАЭ'),
    (337306,'Swiss','LX','Швейцария'),
    (2352168,'EasyJet Switzerland','DS','Швейцария'),
    (453332,'All Nippon Airways','NH','Япония'),
    (960514,'Japan Airlines','JL','Япония'),
    (681262,'Air India','AI','Индия'),
    (236514,'Virgin Australia','VA','Австралия'),
    (1778525,'Austrian Airlines','OS','Австрия'),
    (2413995,'Avianca','AV','Колумбия'),
    (73653,'TAP Portugal','TP','Португалия'),
    (378778,'TAROM','RO','Румыния'),
    (629353,'Air Bucharest','B1*','Румыния'),
    (2703000,'Braathens Regional Airlines','TF','Швеция'),
    (1952819,'SAS','SK','Швеция'),
    (400550,'SmartWings','QS','Чехия'),
    (435984,'South African Airways','SA','ЮАР'),
    (1355045,'Egyptair','MS','Египет'),
    (2564997,'Azul Linhas Aéreas Brasileira','AD','Бразилия'),
    (1746989,'Avianca Brasil','O6','Бразилия'),
    (1171256,'LATAM Brasil','JJ','Бразилия'),
    (842180,'LATAM Chile','LA','Чили'),
    (2046169,'Sky Airline','H2','Чили'),
    (1846389,'Boliviana de Aviación','OB','Боливия'),
    (1128278,'American Airlines','AA','США'),
    (1466359,'Delta Air Lines','DL','США'),
    (2674657,'United Airlines','UA','США'),
    (1972068,'Aeromexico','AM','Мексика'),
    (2169703,'Mexicana','MX','Мексика');



-- Добавление аэропортов в таблицу Airports
INSERT INTO Airports (airport_id, name, city, country)
VALUES
    -- Россия
    (1, 'Шереметьево', 'Москва', 'Россия'),
    (2, 'Домодедово', 'Москва', 'Россия'),
    (3, 'Пулково', 'Санкт-Петербург', 'Россия'),
    (4, 'Кольцово', 'Екатеринбург', 'Россия'),
    (5, 'Казань', 'Казань', 'Россия'),

    -- Китай
    (6, 'Пекин Capital', 'Пекин', 'Китай'),
    (7, 'Шанхай Пудун', 'Шанхай', 'Китай'),
    (8, 'Гуанчжоу Байюнь', 'Гуанчжоу', 'Китай'),
    (9, 'Шэньчжэнь Баоань', 'Шэньчжэнь', 'Китай'),
    (10, 'Чэнду Шуньню', 'Чэнду', 'Китай'),

    -- Ирландия
    (11, 'Дублин', 'Дублин', 'Ирландия'),
    (12, 'Шаннон', 'Шаннон', 'Ирландия'),

    -- Франция
    (13, 'Шарль де Голль', 'Париж', 'Франция'),
    (14, 'Орли', 'Париж', 'Франция'),
    (15, 'Ницца', 'Ницца', 'Франция'),

    -- ОАЭ
    (16, 'Дубай', 'Дубай', 'ОАЭ'),
    (17, 'Абу-Даби', 'Абу-Даби', 'ОАЭ'),

    -- Германия
    (18, 'Франкфурт', 'Франкфурт', 'Германия'),
    (19, 'Мюнхен', 'Мюнхен', 'Германия'),
    (20, 'Берлин Тегель', 'Берлин', 'Германия'),

    -- Канада
    (21, 'Торонто Пирсон', 'Торонто', 'Канада'),
    (22, 'Ванкувер', 'Ванкувер', 'Канада'),
    (23, 'Монреаль', 'Монреаль', 'Канада'),

    -- Испания
    (24, 'Барселона', 'Барселона', 'Испания'),
    (25, 'Мадрид', 'Мадрид', 'Испания'),

    -- Турция
    (26, 'Стамбул', 'Стамбул', 'Турция'),
    (27, 'Анкара', 'Анкара', 'Турция'),
    (28, 'Анталья', 'Анталья', 'Турция'),

    -- Япония
    (29, 'Токио Ханеда', 'Токио', 'Япония'),
    (30, 'Токио Нарита', 'Токио', 'Япония'),

    -- Индия
    (31, 'Индира Ганди', 'Дели', 'Индия'),
    (32, 'Ченнай', 'Ченнай', 'Индия'),

    -- Австралия
    (33, 'Сидней', 'Сидней', 'Австралия'),
    (34, 'Мельбурн', 'Мельбурн', 'Австралия'),

    -- США
    (35, 'Лос-Анджелес', 'Лос-Анджелес', 'США'),
    (36, 'Нью-Йорк JFK', 'Нью-Йорк', 'США'),
    (37, 'Чикаго', 'Чикаго', 'США'),

    -- Бразилия
    (38, 'Грэм-Мендес', 'Сан-Паулу', 'Бразилия'),
    (39, 'Рио-де-Жанейро', 'Рио-де-Жанейро', 'Бразилия'),

    -- Австрия
    (40, 'Вена', 'Вена', 'Австрия'),
    
    -- Болгария
    (41, 'София', 'София', 'Болгария'),
    (42, 'Бургас', 'Бургас', 'Болгария'),

    -- Чехия
    (43, 'Прага', 'Прага', 'Чехия'),

    -- Швейцария
    (44, 'Цюрих', 'Цюрих', 'Швейцария'),
    (45, 'Женева', 'Женева', 'Швейцария'),

    -- Норвегия
    (46, 'Осло Гардемоэн', 'Осло', 'Норвегия'),
    (47, 'Берген', 'Берген', 'Норвегия'),

    -- Швеция
    (48, 'Стокгольм Арланда', 'Стокгольм', 'Швеция'),
    (49, 'Гетеборг', 'Гетеборг', 'Швеция'),

    -- Хорватия
    (50, 'Загреб', 'Загреб', 'Хорватия'),
    (51, 'Сплит', 'Сплит', 'Хорватия'),

    -- Чили
    (52, 'Сантьяго', 'Сантьяго', 'Чили'),

    -- Аргентина
    (53, 'Миндаль', 'Буэнос-Айрес', 'Аргентина'),

    -- Боливия
    (54, 'Эль Альто', 'Ла-Пас', 'Боливия'),

    -- Колумбия
    (55, 'Эль Дорадо', 'Богота', 'Колумбия'),

    -- Мексика
    (56, 'Мехико', 'Мехико', 'Мексика'),
    (57, 'Канкун', 'Канкун', 'Мексика'),

    -- Египет
    (58, 'Каир', 'Каир', 'Египет'),
    (59, 'Хургада', 'Хургада', 'Египет');

-- Добавление рейсов в таблицу Flights
INSERT INTO Flights (flight_id, airline_id, departure_airport_id, arrival_airport_id, departure_time, arrival_time,number_seats, price)
VALUES
    -- Рейсы из Шереметьево (Москва)
    (1, 456439, 1, 2, '2023-12-01 10:00:00', '2023-12-01 11:00:00', 150, 100.00),
    (2, 2223225, 1, 3, '2023-12-01 12:00:00', '2023-12-01 13:30:00', 100, 150.00),
    (3, 51039, 1, 4, '2023-12-01 14:00:00', '2023-12-01 15:30:00', 110, 120.00),
    (4, 2118143, 1, 5, '2023-12-01 16:00:00', '2023-12-01 17:30:00',100, 130.00),
    (5, 456439, 1, 3, '2023-12-01 18:00:00', '2023-12-01 19:30:00',120, 140.00),
    (6, 456439, 1, 40, '2023-12-01 11:00:00', '2023-12-01 14:00:00',150, 140.00),
    (7, 456439, 1, 41, '2023-12-01 13:00:00', '2023-12-01 15:30:00',87, 140.00),
    (8, 456439, 1, 14, '2023-12-01 14:30:00', '2023-12-01 16:30:00',98, 140.00),
    (9, 456439, 1, 58, '2023-12-01 19:00:00', '2023-12-01 21:30:00',160, 140.00),
     -- Рейсы из Домодедово (Москва)
    (10, 456439, 2, 1, '2023-12-02 10:00:00', '2023-12-02 11:00:00',150, 100.00),
    (11, 2223225, 2, 3, '2023-12-02 12:00:00', '2023-12-02 13:30:00',100, 150.00),
    (12, 51039, 2, 4, '2023-12-02 14:00:00', '2023-12-02 15:30:00',100, 120.00),
    (13, 2118143, 2, 5, '2023-12-02 16:00:00', '2023-12-02 17:30:00',110, 130.00),
    (14, 456439, 2, 3, '2023-12-02 18:00:00', '2023-12-02 19:30:00',120, 140.00),
    -- Рейсы из Пулково (Санкт-Петербург)
    (15, 456439, 3, 1, '2023-12-03 09:00:00', '2023-12-03 10:30:00',110, 110.00),
    (16, 2223225, 3, 2, '2023-12-03 11:00:00', '2023-12-03 12:30:00',100, 160.00),
    (17, 51039, 3, 4, '2023-12-03 13:00:00', '2023-12-03 14:30:00',140, 125.00),
    (18, 2118143, 3, 5, '2023-12-03 16:00:00', '2023-12-03 17:30:00',90, 135.00),
    (19, 456439, 3, 1, '2023-12-03 18:00:00', '2023-12-03 19:30:00',88, 145.00),
    -- Рейсы из Кольцово (Екатеринбург)
    (20, 456439, 4, 5, '2023-12-04 10:00:00', '2023-12-04 11:30:00',100, 115.00),
    (21, 2223225, 4, 3, '2023-12-04 12:00:00', '2023-12-04 13:30:00',120, 165.00),
    (22, 51039, 4, 2, '2023-12-04 14:00:00', '2023-12-04 15:30:00',150, 130.00),
    (23, 2118143, 4, 1, '2023-12-04 16:00:00', '2023-12-04 17:30:00',130, 140.00),
    (24, 456439, 4, 3, '2023-12-04 18:00:00', '2023-12-04 19:30:00',90, 150.00),
      -- Рейсы из Казани
    (25, 456439, 5, 4, '2023-12-05 10:00:00', '2023-12-05 11:30:00',100, 120.00),
    (26, 2223225, 5, 3, '2023-12-05 12:00:00', '2023-12-05 13:30:00',100, 170.00),
    (27, 51039, 5, 2, '2023-12-05 14:00:00', '2023-12-05 15:30:00',90, 135.00),
    (28, 2118143, 5, 1, '2023-12-05 16:00:00', '2023-12-05 17:30:00',110, 145.00),
    (29, 456439, 5, 3, '2023-12-05 18:00:00', '2023-12-05 19:30:00',100, 155.00),
    -- Рейсы из Пекина
    (30, 1044948, 6, 7, '2023-12-06 10:00:00', '2023-12-06 11:30:00',120, 200.00),
    (31, 2584653, 6, 8, '2023-12-06 12:00:00', '2023-12-06 13:30:00',130, 210.00),
    (32, 2526005, 6, 9, '2023-12-06 14:00:00', '2023-12-06 15:30:00',150, 220.00),
    (33, 1044948, 6, 10, '2023-12-06 16:00:00', '2023-12-06 17:30:00',120, 230.00),
    (34, 1044948, 6, 30, '2023-12-06 18:00:00', '2023-12-06 19:30:00',100, 240.00),
    -- Рейсы из Шанхая
    (35, 1044948, 7, 6, '2023-12-07 10:00:00', '2023-12-07 11:30:00',150, 200.00),
    (36, 2584653, 7, 8, '2023-12-07 12:00:00', '2023-12-07 13:30:00',150, 210.00),
    (37, 2526005, 7, 9, '2023-12-07 14:00:00', '2023-12-07 15:30:00',110, 220.00),
    (38, 1044948, 7, 10, '2023-12-07 16:00:00', '2023-12-07 17:30:00',120, 230.00),
    (39, 2526005, 7, 6, '2023-12-07 18:00:00', '2023-12-07 19:30:00',130, 240.00),
 -- Рейсы из Дублина
    (40, 1287223, 11, 12, '2023-12-08 10:00:00', '2023-12-08 11:30:00',130, 180.00),
    (41, 1287223, 11, 12, '2023-12-08 12:00:00', '2023-12-08 13:30:00',120, 190.00),
    (42, 1287223, 11, 12, '2023-12-08 14:00:00', '2023-12-08 15:30:00',140, 200.00),
    (43, 1287223, 11, 12, '2023-12-08 16:00:00', '2023-12-08 17:30:00',140, 210.00),
    (44, 1287223, 11, 19, '2023-12-08 18:00:00', '2023-12-08 19:30:00',150, 220.00),
    -- Рейсы из Парижа
    (45, 2941943, 13, 14, '2023-12-09 10:00:00', '2023-12-09 11:30:00',100, 250.00),
    (46, 1918455, 13, 15, '2023-12-09 12:00:00', '2023-12-09 13:30:00',80, 260.00),
    (47, 2941943, 13, 26, '2023-12-09 14:00:00', '2023-12-09 15:30:00',90, 270.00),
    (48, 1918455, 13, 43, '2023-12-09 16:00:00', '2023-12-09 17:30:00',110, 280.00),
    (49, 1918455, 13, 49, '2023-12-09 18:00:00', '2023-12-09 19:30:00',100,290.00);